# Whitney Hardy 
## Task 4.5 Data Consistency Checks

### Content list 
- Importing libraires
- Import Data
- Exercise 4.5 following reading
- Steps 2-10
- Export

### Importing Libraries

In [1]:
# Importing libraries
import pandas as pd
import numpy as np
import os

In [2]:
# create a path 
path = r'C:\Users\hardy\10-2025 Instacart Basket Analysis'

In [3]:
#check output
path

'C:\\Users\\hardy\\10-2025 Instacart Basket Analysis'

### Import Data

In [4]:
#import orders data
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [5]:
#import produce data
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'prods_wrangled.csv'), index_col = False)

In [6]:
#check ords
df_ords.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
1,1,2398795,1,2,3,7,15.0
2,2,473747,1,3,3,12,21.0
3,3,2254736,1,4,4,7,29.0
4,4,431534,1,5,4,15,28.0

In [7]:
#check prods
df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

### Exercise 4.5 following reading

In [8]:
# create a dataframe
df_test= pd.DataFrame()

In [9]:
#create a mixed type column
df_test['mix'] = ['a', 'b', 1, True]

In [10]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [11]:
# check for mixed types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

C:\Users\hardy\AppData\Local\Temp\ipykernel_13944\2671172800.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [12]:
#finding mixing values
df_prods.isnull().sum()

Unnamed: 0        0
product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [13]:
#create a subset of dataframe to view 16 missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [14]:
df_nan

       Unnamed: 0  product_id product_name  aisle_id  department_id  prices
33             33          34          NaN       121             14    12.2
68             68          69          NaN        26              7    11.8
115           115         116          NaN        93              3    10.8
261           261         262          NaN       110             13    12.1
525           525         525          NaN       109             11     1.2
1511         1511        1511          NaN        84             16    14.3
1780         1780        1780          NaN       126             11    12.3
2240         2240        2240          NaN        52              1    14.2
2586         2586        2586          NaN       104             13    12.4
3159         3159        3159          NaN       126             11    13.1
3230         3230        3230          NaN       120             16    14.4
3736         3736        3736          NaN        41              8    14.8
4283         4283        4283          NaN        77              7    14.4
4790         4790        4790          NaN        91             16    14.5
38187       38187       38183          NaN        39             12    20.9
40444       40444       40440          NaN       120             16    14.8

In [15]:
# compare the number of rows in your current dataframe with the number in your subset once the missing rows have been removed
df_prods.shape

(49693, 6)

In [17]:
#create new dataframe with cleaned items
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [18]:
#check  output
df_prods_clean.shape

(49677, 6)

In [19]:
# looking for duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [20]:
#checking output
df_dups

Empty DataFrame
Columns: [Unnamed: 0, product_id, product_name, aisle_id, department_id, prices]
Index: []

In [21]:
df_prods_clean.shape

(49677, 6)

In [22]:
#create new dataframe without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [23]:
df_prods_clean_no_dups.shape

(49677, 6)

In [24]:
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

In [25]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [26]:
#finding mixing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [27]:
#create a subset of dataframe to view 16 missing values
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [28]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [29]:
# compare the number of rows in your current dataframe with the number in your subset once the missing rows have been removed
df_prods.shape

(49693, 5)

In [30]:
# create new dataframe (clean) without missing data
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [31]:
df_prods_clean.shape

(49677, 5)

In [32]:
# looking for duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [33]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [34]:
df_prods_clean.shape

(49677, 5)

In [35]:
#create new dataframe without duplicates
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [36]:
df_prods_clean_no_dups.shape

(49672, 5)

In [38]:
#checking most expensive items
top_10_expensive = df_prods_clean_no_dups.nlargest(10, 'prices')

In [39]:
#view results
top_10_expensive

,product_id,product_name,aisle_id,department_id,prices
33666,33664,2 % Reduced Fat Milk,84,16,99999.0
21554,21553,Lowfat 2% Milkfat Cottage Cheese,108,16,14900.0
9020,9020,Boneless Skinless Chicken Thighs,35,12,25.0
19392,19391,Turkey Breast Tenderloins,49,12,25.0
21468,21467,Wild Caught Raw Shrimp,15,12,25.0
25580,25579,Naturally Smoked Trout Fillet,15,12,25.0
40490,40486,Chicken Tenders,49,12,25.0
9896,9896,Uncured Applewood Smoked Bacon,106,12,24.9
14207,14207,Angus Roast Beef,7,12,24.9
36577,36573,Peppered Bacon,106,12,24.9

In [42]:
#drop top two items
top_10_expensive = top_10_expensive.iloc[2:]

In [43]:
#check
top_10_expensive

,product_id,product_name,aisle_id,department_id,prices
21468,21467,Wild Caught Raw Shrimp,15,12,25.0
25580,25579,Naturally Smoked Trout Fillet,15,12,25.0
40490,40486,Chicken Tenders,49,12,25.0
9896,9896,Uncured Applewood Smoked Bacon,106,12,24.9
14207,14207,Angus Roast Beef,7,12,24.9
36577,36573,Peppered Bacon,106,12,24.9

In [44]:
# Remove rows where product_id matches the deleted items
df_prods_clean_no_dups = df_prods_clean_no_dups[~df_prods_clean_no_dups['product_id'].isin([33664, 21553])]

In [45]:
df_prods_clean_no_dups

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

In [46]:
# export new data file
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'))

### Steps 2-10

In [47]:
# reviewing orders dataframe 
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

I am noticing 0 number of days in the days_since_prior_order and that feels like possible dupilcated records or missing data.

In [48]:
# step 3-checking df for mixed-type columns 
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != type(df_test[col].iloc[0])).any(axis=1)
  if len(df_test[weird]) > 0:
    print(col)

mix

C:\Users\hardy\AppData\Local\Temp\ipykernel_13944\2280987668.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != type(df_test[col].iloc[0])).any(axis=1)

I am not seeing any mixed type data in dataframe.

In [50]:
#checing data types of all colums in the orders df
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3421083 entries, 0 to 3421082
Data columns (total 7 columns):
 #   Column                  Dtype
---  ------                  -----
 0   Unnamed: 0              int64
 1   order_id                int64
 2   user_id                 int64
 3   order_number            int64
 4   orders_day_of_week      int64
 5   order_hour_of_day       int64
 6   days_since_prior_order  float64
dtypes: float64(1), int64(6)
memory usage: 182.7 MB

In [51]:
#step 5- run a check for missing values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

Step 5- days_since_prior_order has 2062009 missing values I made a subset of the rows with values missing from days_since_prior_order to further investigate missing values

In [52]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull() == True]

In [53]:
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

In [54]:
#step 6-
#checking to see if all nan values in days_since_prior_order is equal to 1st time orders from a customer
df_ords_nan['order_number'].value_counts()

order_number
1    206209
Name: count, dtype: int64

This confirms that all nan values under days_since_prior_order are the customers first order with instacart they can not be deleted. The best course of action would be to make a new variable that acts as a flag to indicate all first time customers.

In [55]:
#making new flag for first time customers
df_ords['first_order'] = df_ords['days_since_prior_order'].isna()

In [56]:
#checking 
df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0,False
3421079,3421079,1854736,206209,11,4,10,30.0,False
3421080,3421080,626363,206209,12,1,12,18.0,False
3421081,3421081,2977660,206209,13,1,12,7.0,False
3421082,3421082,272231,206209,14,6,14,30.0,False

In [57]:
#Step 7 check for duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [58]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, first_order]
Index: []

### Export

In [59]:
#updating name to keep organized
df_ords_clean = df_ords

In [60]:
df_ords_clean

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order
0,0,2539329,1,1,2,8,NaN,True
1,1,2398795,1,2,3,7,15.0,False
2,2,473747,1,3,3,12,21.0,False
3,3,2254736,1,4,4,7,29.0,False
4,4,431534,1,5,4,15,28.0,False
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0,False
3421079,3421079,1854736,206209,11,4,10,30.0,False
3421080,3421080,626363,206209,12,1,12,18.0,False
3421081,3421081,2977660,206209,13,1,12,7.0,False
3421082,3421082,272231,206209,14,6,14,30.0,False

In [61]:
#export 
df_ords_clean.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'orders_checked.csv'))